// const pow = (base, exp) => {
//   return base ** exp;
// };

// const sum = (a, b) => a + b;
//===================================================

//старый синтаксис, на Реакте не подходит
//module.exports = pow;
//===================================================

//экспорт значения по умолчанию
//новый синтаксис для экспорта, аналогичный предыдущему
//export default pow;
//===================================================

//экспорт объекта
//export  default{ pow, sum };
//===================================================

//именованный экспорт
//экспорт объекта сразу при объявлении функции
export const pow = (base, exp) => {
  return base ** exp;
};

export const sum = (a, b) => a + b;
//===================================================

class MyMath {
  static div = (a, b) => a / b;
  static mul = (a, b) => a * b;
}
export default MyMath;
